import man1 from "../../assets/imgs/photos/man1.jpg";
import man2 from "../../assets/imgs/photos/man2.jpg";
import woman1 from "../../assets/imgs/photos/woman1.jpg";
import woman2 from "../../assets/imgs/photos/woman2.jpg";
import woman3 from "../../assets/imgs/photos/woman3.jpg";

export const data = [
  {
    title: "Моя родина плакала від щастя",
    text: "Я користуюся сервісом вже кілька місяців і можу впевнено сказати – це неймовірний досвід. Від замовлення до готового відео все було професійно та уважно. Результат перевершив очікування, а ручна анімація старих фотографій довела мою родину до сліз щастя.",
    img: man1,
    name: "Іван П.",
    city: "Львів, Україна",
  },
  {
    title: "Абсолютно магічні результати",
    text: "Замовила кілька відео у вашої команди і була приємно вражена. Кожна деталь зроблена з любов’ю та майстерністю, а старі фотографії бабусі буквально ожили. Всі родичі були в захваті від такого результату!",
    img: woman1,
    name: "Софія М.",
    city: "Київ, Україна",
  },
  {
    title: "Ідеальне збереження спогадів",
    text: "Я дуже ціную спогади і була щаслива знайти ваш сервіс. Усі фото відреставровані вручну, а відео якісне та красиве. Процес замовлення був простий, а результат – емоційний та справжній.",
    img: woman2,
    name: "Олександра Р.",
    city: "Одеса, Україна",
  },
  {
    title: "Перевищили всі очікування!",
    text: "Весь досвід був чудовим! Замовлення обробили швидко, а готові відео повністю відповідали моїм очікуванням. Моя бабуся розплакалася, побачивши своє весільне фото в русі, і я був вражений професійністю та деталізацією роботи.",
    img: man2,
    name: "Михайло Т.",
    city: "Харків, Україна",
  },
  {
    title: "Вартує кожної копійки",
    text: "Спершу я сумнівалася, але сервіс повністю перевершив мої очікування. Кожна фотографія реставрована та анімована вручну, а результат – просто магія. Моя родина була в захваті. Дійсно варте кожної витраченої копійки!",
    img: woman3,
    name: "Руслана К.",
    city: "Дніпро, Україна",
  },
];
